export const FISH = [
  'ブリ', 'シーバス', 'マダイ', 'アジ', 'カマス', 'サバ', 'イワシ', 'サヨリ', 'カンパチ', 'カツオ', 'サワラ', 'シイラ', 'ヒラマサ', 'ヒラメ', 'カレイ', 'マゴチ', 'キス', 'カワハギ', 'カサゴ', 'メバル', 'キジハタ', 'クエ', 'アカハタ', 'オオモンハタ', 'タチウオ', 'クロダイ', 'キビレ', 'メジナ', 'イサキ', 'アナゴ', 'ウナギ', 'タコ', 'アオリイカ', 'スルメイカ', 'ヤリイカ', 'コウイカ', 'イシダイ', 'イシガキダイ', 'タマン', 'メッキ', 'アイゴ', 'ブダイ', 'アオブダイ', 'ホウボウ', 'オニカサゴ', 'ロウニンアジ', 'コブダイ', 'マトウダイ', 'タケノコメバル', 'シマアジ', 'イシモチ', 'サッパ', 'オオニベ', 'サメ', 'エイ', 'シブダイ', 'ソイ', 'アイナメ', 'ナンヨウカイワリ', 'オジサン', 'ウマヅラハギ', 'イラ', 'キハダマグロ', 'ツムブリ', 'アオチビキ', 'カジカ', 'ホッケ', 'カスミアジ', 'オニヒラアジ', 'ギンガメアジ', 'オコゼ', 'ワニゴチ', 'ヒイカ', 'コノシロ', 'ムロアジ', 'コショウダイ', 'イトヨリダイ', 'レンコダイ', 'イスズミ', 'シロダイ', 'マクブ', 'アカジン', 'グルクン', 'オニカマス', 'カンモンハタ', 'ヒメダイ', 'ウメイロ', ''
] as const

// export const SPECIES = [
//   'アジ科', '青物', 'イカ類', 'ハタ類', 'フエダイ', 'タイ類', '底物', 'フラットフィッシュ', 'カツオ'
// ] as const

export const LOOKBACK_DAYS = [1, 3, 5, 7] as const
